<header class="masthead" style="background-image: url('/project/webroot/img/myphoto.jpg')">
    <div class="container position-relative px-4 px-lg-5">
        <div class="row gx-4 gx-lg-5 justify-content-center">
            <div class="col-md-10 col-lg-8 col-xl-7">
                <div class="page-heading">
                    <h1>О себе</h1>
                    <span class="subheading">Понемногу изучаю PHP</span>
                </div>
            </div>
        </div>

    </div>
</header>
<h5>Описание процесса выполнения тестового задания.
</h5>
<p>Ознакомившись с тестовым заданием я сразу решил сделать нечто подобное, тк работаю на данный момент барменом. Нашел html шаблон, которые мне приглянулся. Что-то об архитектуре говорить сложно, так как это слишком заумно для меня сейчас и не по моему уровню. Но логика такая, что пользователь ищет и смотрит коктейли,оценивает их,может писать комментарии. Вначале была идея сделать "коктейльную" страницу по разным рубрикам, но я отказался от этого и решил вывести все сразу, тк коктейлей огромное колчисетво и все они разные технологически и рецептурно, что требует создания разных таблиц. Я вывел кокйтейли с самым простым рецептом, где всего два-три ингридиента. Прочитав слово "архитектура" первое, что мне пришло голову это MVC. Ранее я был знаком с этим и нашел заготовку у себя. И начал раелизовывать контроллеры,представления, прокладывать роуты,вывод таблицы. Затем я столкнулся с непониманием роутов POST запросов, как их записывать, обрабатывать, прокладывать, тк все остальное было на GET запросах. Идею о регистрации, комментариях я отклонил и не справившись далее я решил отправить что есть, как мой уровень того, что я сейчас могу сделать</p>